Revit 2020 API
NurbSpline.isClosed Property
Return/set the nurb spline's isClosed property.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public bool isClosed { get; set; }
Visual Basic
Public Property isClosed As Boolean
	Get
	Set
Visual C++
public:
property bool isClosed {
	bool get ();
	void set (bool value);
}
See Also
NurbSpline Class
Autodesk.Revit.DB Namespace